espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_trustzone/src/sli_tz_secure_main.c
/***************************************************************************//**
 * @file
 * @brief Silicon Labs TrustZone secure main implementation.
 *******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#if defined (SL_COMPONENT_CATALOG_PRESENT)
  #include "sl_component_catalog.h"
#endif

#include "arm_cmse.h"
#include "em_device.h"
#include "psa/crypto.h"

#if defined(SL_CATALOG_GECKO_BOOTLOADER_INTERFACE_PRESENT)
  #include "sl_mpu.h"
#endif

#if defined(SEMAILBOX_PRESENT)
  #include "sl_se_manager_util.h"
#else
  #include "psa/internal_trusted_storage.h"
  #include "sli_psa_driver_common.h"
#endif

#include "sli_se_version_dependencies.h"

// -----------------------------------------------------------------------------
// External symbols

#if defined(__GNUC__)
extern const uint32_t linker_sg_begin;
extern const uint32_t linker_vectors_begin;
#elif defined(__ICCARM__)
const uint32_t linker_sg_begin @ "Veneer$$CMSE";
const uint32_t linker_vectors_begin @ ".intvec";
#endif

#if defined(MBEDTLS_PSA_CRYPTO_STORAGE_C) && defined(SLI_PSA_ITS_ENCRYPTED)
// Extern declaration is required due to the duplicate header used when
// the ITS service is compiled for the SKL secure appication.
extern psa_status_t sli_psa_its_set_root_key(uint8_t *root_key, size_t root_key_size);
#endif

// -----------------------------------------------------------------------------
// Typedefs

typedef void (*nsfunc)(void) __attribute__((cmse_nonsecure_call));

// -----------------------------------------------------------------------------
// Macros

#define INFINITE_LOOP() while (1) {}

#define AIRCR_UNLOCK_VECTKEY 0x5FAUL

// Mark the full range below as NS in SAU,
// and let the PPU generate access faults instead.
#define PERIPHERALS_BASE_NS_START (0x50000000)
#define PERIPHERALS_BASE_NS_END   (0xBFFFFFFF)

#define EPPB_REGION_START (0xE0044000)
#define EPPB_REGION_END   (0xE00FDFFF)

// Lock every page up until the NS app.
#define NUM_PAGES_TO_LOCK ((TZ_NS_FLASH_OFFSET + FLASH_PAGE_SIZE - 1) \
                           / FLASH_PAGE_SIZE)

// Each page is represented as a bit in the registers.
#define NUM_PAGELOCK_REGISTERS (FLASH_SIZE / FLASH_PAGE_SIZE / 32)

#if defined (__ICCARM__)
  #define BUILTIN_UNREACHABLE()
#elif defined (__GNUC__)
  #define BUILTIN_UNREACHABLE() __builtin_unreachable();
#endif

// -----------------------------------------------------------------------------
// Static function declarations

static inline void configure_sau(void);
static inline void configure_smu(void);
static inline void smu_configure_peripherals(void);
static inline void smu_configure_bus_masters(void);
static inline void smu_enable_security_fault_interrupts(void);
static inline void configure_interrupt_target_states(void);
static inline void prioritise_secure_exceptions(void);
static inline void enable_fault_exceptions(void);
static inline void enable_ns_fpu(void);
static inline void enable_page_locks(void);
static inline void start_ns_app(void);
#if defined(CRYPTOACC_PRESENT)
static inline void clear_rootdata(void);
#endif
static inline void fatal_error(void);

#if defined(SL_CATALOG_GECKO_BOOTLOADER_INTERFACE_PRESENT)
static inline void configure_mpu(void);
#endif

#if defined(MBEDTLS_PSA_CRYPTO_STORAGE_C) && defined(SLI_PSA_ITS_ENCRYPTED)
#if defined(SEMAILBOX_PRESENT)
static inline void verify_hse_version(void);
#else
static inline void setup_storage_root_key(void);
#endif
#endif // defined(MBEDTLS_PSA_CRYPTO_STORAGE_C) && defined(SLI_PSA_ITS_ENCRYPTED)

// -----------------------------------------------------------------------------
// Static constants

// We will use an array of pagelock registers in order to keep
// the lock setting logic from becoming unreadable. This also
// means that the code will handle differences in flash size.
static volatile uint32_t *const pagelock_registers[] = {
  #if defined(_MSC_PAGELOCKWORD0_RESETVALUE)
  &MSC->PAGELOCKWORD0_SET,
  #elif defined(_MSC_PAGELOCK0_RESETVALUE)
  &MSC->PAGELOCK0_SET,
  #else
  // All devices must have at least one pagelock register.
  #error "Unable to lock pages for this device"
  #endif
  #if defined(_MSC_PAGELOCKWORD1_RESETVALUE)
  &MSC->PAGELOCKWORD1_SET,
  #elif defined(_MSC_PAGELOCK1_RESETVALUE)
  &MSC->PAGELOCK1_SET,
  #endif
  #if defined(_MSC_PAGELOCKWORD2_RESETVALUE)
  &MSC->PAGELOCKWORD2_SET,
  #elif defined(_MSC_PAGELOCK2_RESETVALUE)
  &MSC->PAGELOCK2_SET,
  #endif
  #if defined(_MSC_PAGELOCKWORD3_RESETVALUE)
  &MSC->PAGELOCKWORD3_SET,
  #elif defined(_MSC_PAGELOCK3_RESETVALUE)
  &MSC->PAGELOCK3_SET,
  #endif
  #if defined(_MSC_PAGELOCKWORD4_RESETVALUE)
  &MSC->PAGELOCKWORD4_SET,
  #endif
  #if defined(_MSC_PAGELOCKWORD5_RESETVALUE)
  &MSC->PAGELOCKWORD5_SET,
  #endif
  #if defined(_MSC_PAGELOCKWORD6_RESETVALUE)
  &MSC->PAGELOCKWORD6_SET,
  #endif
  #if defined(_MSC_PAGELOCKWORD7_RESETVALUE)
  &MSC->PAGELOCKWORD7_SET,
  #endif
};

