espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_trustzone/src/sli_tz_secure_main.c
// -----------------------------------------------------------------------------
// Test functions

#if defined(SLI_TZ_TEST_MEMORY_BOUNDARY)
extern void tz_test_memory_boundary(void);
#if defined(CRYPTOACC_PRESENT)
extern void tz_test_memory_prepare(void);
#endif // CRYPTOACC_PRESENT
#endif

// -----------------------------------------------------------------------------
// Main function

int main(void)
{
  enable_fault_exceptions();

  // Prioritise secure exceptions to avoid NS being able to pre-empt
  // secure SVC or SecureFault.
  prioritise_secure_exceptions();

  // Configure interrupt target states before any secure interrupts are enabled.
  configure_interrupt_target_states();

  #if defined(MBEDTLS_PSA_CRYPTO_STORAGE_C) && defined(SLI_PSA_ITS_ENCRYPTED)
  #if defined(SEMAILBOX_PRESENT)
  // HSE devices don't need any SRK initialization, since it will be available as an internal
  // key. However, we'll still check the SE version to ensure that SRK is supported.
  verify_hse_version();
  #else // SEMAILBOX_PRESENT
  // Setup SRK for devices without an HSE. (The SE version is checked as part of this
  // procedure.) Note that this is done before setting up the SAU/SMU since the root key is
  // stored in FRCRAM which is not guaranteed to stay Secure after TZ initialization. We
  // therefore need to initialize and clear the SRK passed from the VSE before setting
  // anything to Non-Secure.
  setup_storage_root_key();
  #endif // SEMAILBOX_PRESENT
  #endif // defined(MBEDTLS_PSA_CRYPTO_STORAGE_C) && defined(SLI_PSA_ITS_ENCRYPTED)

  #if defined(CRYPTOACC_PRESENT)
  #if defined(SLI_TZ_TEST_MEMORY_BOUNDARY)
  tz_test_memory_prepare();
  #endif
  // At the startup of the VSE devices, we need to invalidate the
  // ROOTDATA0 register which is only accessible by S to ensure that NS apps
  // can't craft a malicious mailbox command. This is a possible scenario since
  // FRCRAM, which is used as the (virtual) mailbox interface has to be configured as NS.
  clear_rootdata();
  #endif // CRYPTOACC_PRESENT

  // We should configure the SAU as early as possible in order to avoid odd
  // PPU security faults when accessing peripherals (e.g. CMU) after they have
  // been reconfigured by the SMU.
  configure_sau();
  configure_smu();
  #if defined(SL_CATALOG_GECKO_BOOTLOADER_INTERFACE_PRESENT)
  configure_mpu();
  #endif // SL_CATALOG_GECKO_BOOTLOADER_INTERFACE_PRESENT

  // The NS app should not be able to write to secure flash (including the
  // bootloader). As an extra layer of protection, we will enable flash page
  // locks. This also stops the NS app from being able to erase the S code
  // using the MSC service, which is another benefit.
  enable_page_locks();

  #if defined(SLI_TZ_TEST_MEMORY_BOUNDARY)
  tz_test_memory_boundary();
  #endif // SLI_TZ_TEST_MEMORY_BOUNDARY

  psa_crypto_init();

  enable_ns_fpu();

  start_ns_app();

  // Will never get here, as non-secure software doesn't return.
  INFINITE_LOOP();
}

// -----------------------------------------------------------------------------
// Static functions

/**************************************************************************//**
 * @brief Handle a fault by performing a soft reset.
 *****************************************************************************/
static inline void fatal_error(void)
{
  #if defined(DEBUG_EFM)
  INFINITE_LOOP();
  #else
  NVIC_SystemReset();
  BUILTIN_UNREACHABLE();
  #endif
}

#if defined(CRYPTOACC_PRESENT)
/**************************************************************************//**
 * @brief Clear the ROOTDATA0 register
 *****************************************************************************/
static inline void clear_rootdata(void)
{
  #if defined(CMU_CLKEN0_SYSCFG)
  // Saving the state is not necessary.
  CMU_S->CLKEN0_SET = CMU_CLKEN0_SYSCFG;
  #endif

  // We only clear ROOTDATA0, which is used as the input channel.
  SYSCFG_S->ROOTDATA0 = _SYSCFG_ROOTDATA0_RESETVALUE;

  #if defined(CMU_CLKEN0_SYSCFG)
  CMU_S->CLKEN0_CLR = CMU_CLKEN0_SYSCFG;
  #endif
}
#endif

#if defined(SL_CATALOG_GECKO_BOOTLOADER_INTERFACE_PRESENT)
/**************************************************************************//**
 * @brief Configure the memory region below the secure main to XN
 *****************************************************************************/
static inline void configure_mpu(void)
{
  sl_status_t status = sl_mpu_disable_execute(FLASH_BASE,
                                              (uint32_t)&linker_vectors_begin,
                                              (uint32_t)&linker_vectors_begin - FLASH_BASE - 1u);
  if (status != SL_STATUS_OK) {
    INFINITE_LOOP();
  }
}
#endif // SL_CATALOG_GECKO_BOOTLOADER_INTERFACE_PRESENT

/**************************************************************************//**
 * @brief Configure the memory ranges' security attributes using the SAU.
 *****************************************************************************/
static inline void configure_sau(void)
{
  #define CONFIGURED_SAU_REGIONS 7

  // Disable all the regions
  for (uint32_t i = CONFIGURED_SAU_REGIONS;
       i < ((SAU->TYPE & SAU_TYPE_SREGION_Msk) >> SAU_TYPE_SREGION_Pos);
       i++) {
    SAU->RNR = i;
    SAU->RLAR = 0u;
  }

  // Configure SAU for flash
  SAU->RNR = 0; // Flash
  SAU->RBAR = ((uint32_t)&linker_sg_begin) & SAU_RBAR_BADDR_Msk;
  SAU->RLAR = ((FLASH_BASE + FLASH_SIZE - 1u) & SAU_RLAR_LADDR_Msk)
              | (0 << SAU_RLAR_NSC_Pos)
              | SAU_RLAR_ENABLE_Msk;
  SAU->RNR = 1; // NS Peripherals
  SAU->RBAR = PERIPHERALS_BASE_NS_START & SAU_RBAR_BADDR_Msk;
  SAU->RLAR = ((PERIPHERALS_BASE_NS_END) &SAU_RLAR_LADDR_Msk)
              | (0 << SAU_RLAR_NSC_Pos)
              | SAU_RLAR_ENABLE_Msk;
  SAU->RNR = 2; // SRAM
  SAU->RBAR = (SRAM_BASE + TZ_NS_RAM_OFFSET) & SAU_RBAR_BADDR_Msk;
  SAU->RLAR = ((SRAM_BASE + SRAM_SIZE - 1u) & SAU_RLAR_LADDR_Msk)
              | (0 << SAU_RLAR_NSC_Pos)
              | SAU_RLAR_ENABLE_Msk;
  SAU->RNR = 3; // User Data
  SAU->RBAR = MSC_FLASH_USERDATA_MEM_BASE & SAU_RBAR_BADDR_Msk;
  SAU->RLAR = (MSC_FLASH_USERDATA_MEM_END & SAU_RLAR_LADDR_Msk)
              | (0 << SAU_RLAR_NSC_Pos)
              | SAU_RLAR_ENABLE_Msk;
  SAU->RNR = 4; // Device Info
  SAU->RBAR = MSC_FLASH_DEVINFO_MEM_BASE & SAU_RBAR_BADDR_Msk;
  SAU->RLAR = (MSC_FLASH_DEVINFO_MEM_END & SAU_RLAR_LADDR_Msk)
              | (0 << SAU_RLAR_NSC_Pos)
              | SAU_RLAR_ENABLE_Msk;
  SAU->RNR = 5; // Chip Config
  SAU->RBAR = MSC_FLASH_CHIPCONFIG_MEM_BASE & SAU_RBAR_BADDR_Msk;
  SAU->RLAR = (MSC_FLASH_CHIPCONFIG_MEM_END & SAU_RLAR_LADDR_Msk)
              | (0 << SAU_RLAR_NSC_Pos)
              | SAU_RLAR_ENABLE_Msk;
  SAU->RNR = 6; // EPPB
  SAU->RBAR = EPPB_REGION_START & SAU_RBAR_BADDR_Msk;
  SAU->RLAR = (EPPB_REGION_END & SAU_RLAR_LADDR_Msk)
              | (0 << SAU_RLAR_NSC_Pos)
              | SAU_RLAR_ENABLE_Msk;
  TZ_SAU_Enable();

