espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_trustzone/src/sli_tz_secure_main.c
  // Ensure that the new SAU configuration is used by subsequent instructions.
  __DSB();
  __ISB();
}

/**************************************************************************//**
 * @brief Configures the TZ memory map using the SMU.
 *
 * Configures the memory map with the SMU using the defines TZ_NS_FLASH_OFFSET
 * and TZ_NS_RAM_OFFSET as start locations for the non-secure sections in flash
 * and RAM. All of the peripherals are mapped and available for the non-secure
 * application, except for the a few secure-only peripherals.
 *****************************************************************************/
static inline void configure_smu(void)
{
  // Enable clocking (where necessary).
  #if (_SILICON_LABS_32B_SERIES_2_CONFIG > 1)
  CMU_S->CLKEN1_SET = CMU_CLKEN1_SMU;
  #endif
  SMU->LOCK = SMU_LOCK_SMULOCKKEY_UNLOCK;

  // Configure flash into S/NSC/NS regions.

  // S - NSC boundary
  SMU->ESAUMRB01 = FLASH_BASE & _SMU_ESAUMRB01_MASK;
  // NSC - NS boundary
  SMU->ESAUMRB12 = (FLASH_BASE + TZ_NS_FLASH_OFFSET) & _SMU_ESAUMRB12_MASK;

  // Configure RAM into S/NS regions.

  // S - NSC boundary
  SMU->ESAUMRB45 = (SRAM_BASE + TZ_NS_RAM_OFFSET) & _SMU_ESAUMRB45_MASK;
  // NSC - NS boundary
  SMU->ESAUMRB56 = (SRAM_BASE + TZ_NS_RAM_OFFSET) & _SMU_ESAUMRB56_MASK;

  // Make the info page NS.
  SMU->ESAURTYPES0 = SMU_ESAURTYPES0_ESAUR3NS;

  // Make the EPPB area NS.
  SMU->ESAURTYPES1 = SMU_ESAURTYPES1_ESAUR11NS;

  smu_configure_peripherals();

  smu_configure_bus_masters();

  smu_enable_security_fault_interrupts();

  // Lock SMU config.
  SMU->LOCK = 0;

  // Disable clocking (where necessary).
  #if (_SILICON_LABS_32B_SERIES_2_CONFIG > 1)
  CMU_NS->CLKEN1_CLR = CMU_CLKEN1_SMU;
  #endif
}

/**************************************************************************//**
 * @brief Configures secure attributes of peripherals using the SMU.
 *
 * This function is device dependent. Assumes that the SMU is clocked.
 *****************************************************************************/
static inline void smu_configure_peripherals(void)
{
  #if defined(SEMAILBOX_PRESENT)
  // All peripherals are non-secure except SMU, SEMAILBOX, MSC and SYSCFG.
  SMU->PPUSATD0_CLR = _SMU_PPUSATD0_MASK
                      & ~(SMU_PPUSATD0_SYSCFG
                          | SMU_PPUSATD0_MSC);
  SMU->PPUSATD1_CLR = _SMU_PPUSATD1_MASK
                      & ~(SMU_PPUSATD1_SMU
                          | SMU_PPUSATD1_SEMAILBOX);
  #elif defined(CRYPTOACC_PRESENT)
  // All peripherals are non-secure except SMU, CRYPTOACC, MSC and SYSCFG.
  SMU->PPUSATD0_CLR = _SMU_PPUSATD0_MASK
                      & ~(SMU_PPUSATD0_SYSCFG
                          | SMU_PPUSATD0_MSC);
  SMU->PPUSATD1_CLR = _SMU_PPUSATD1_MASK
                      & ~(SMU_PPUSATD1_SMU
                          | SMU_PPUSATD1_CRYPTOACC);
  #endif
}

/**************************************************************************//**
 * @brief Configures secure state of bus masters using the SMU.
 *
 * This function is device dependent. Assumes that the SMU is clocked.
 *****************************************************************************/
static inline void smu_configure_bus_masters(void)
{
  #if defined(SEMAILBOX_PRESENT) && (_SILICON_LABS_32B_SERIES_2_CONFIG == 1)
  // Configure all bus-masters execpt for SEDMA as non-secure.
  SMU->BMPUSATD0_CLR = _SMU_BMPUSATD0_MASK
                       & ~(SMU_BMPUSATD0_SEDMA);
  #elif defined(SEMAILBOX_PRESENT) && (_SILICON_LABS_32B_SERIES_2_CONFIG > 1)
  // Configure all bus-masters execpt for SEEXTDMA as non-secure.
  SMU->BMPUSATD0_CLR = _SMU_BMPUSATD0_MASK
                       & ~(SMU_BMPUSATD0_SEEXTDMA);
  #elif defined(CRYPTOACC_PRESENT)
  // Configure all bus-masters execpt for CRYPTOACC as non-secure.
  SMU->BMPUSATD0_CLR = _SMU_BMPUSATD0_MASK
                       & ~(SMU_BMPUSATD0_CRYPTOACC);
  #endif
}

/**************************************************************************//**
 * @brief Enable SMU security fault interrupts.
 *
 * Assumes that the SMU is clocked.
 *****************************************************************************/
static inline void smu_enable_security_fault_interrupts(void)
{
  NVIC_ClearPendingIRQ(SMU_SECURE_IRQn);
  SMU->IF_CLR = SMU_IF_PPUSEC | SMU_IF_BMPUSEC;
  NVIC_EnableIRQ(SMU_SECURE_IRQn);
  SMU->IEN = SMU_IEN_PPUSEC | SMU_IEN_BMPUSEC;
}

/**************************************************************************//**
 * @brief Configure interrupt target states.
 *
 * Interrupts must either point at the secure or non-secure world. After reset
 * everything points to the secure world, and this function redirects all
 * intterupts to non-secure to better support existing applications.
 *****************************************************************************/
static inline void configure_interrupt_target_states(void)
{
  // Start by setting all Interrupt Non-Secure State (ITNS) bits. This results
  // in all IRQs being targeted at the NS world.
  for (size_t i = 0; i < sizeof(NVIC->ITNS) / sizeof(NVIC->ITNS[0]); i++) {
    NVIC->ITNS[i] = 0xFFFFFFFF;
  }

  // Clear the ITNS bits corresponding to all IRQs belonging to S peripherals.
  #if defined(SEMAILBOX_PRESENT)
  NVIC_ClearTargetState(SEMBRX_IRQn);
  NVIC_ClearTargetState(SEMBTX_IRQn);
  NVIC_ClearTargetState(SMU_SECURE_IRQn);
  NVIC_ClearTargetState(SYSCFG_IRQn);
  NVIC_ClearTargetState(MSC_IRQn);
  #elif defined(CRYPTOACC_PRESENT)
  NVIC_ClearTargetState(CRYPTOACC_IRQn);
  NVIC_ClearTargetState(TRNG_IRQn);
  NVIC_ClearTargetState(PKE_IRQn);
  NVIC_ClearTargetState(SMU_SECURE_IRQn);
  NVIC_ClearTargetState(SYSCFG_IRQn);
  NVIC_ClearTargetState(MSC_IRQn);
  #endif
}

/**************************************************************************//**
 * @brief Prioritize the secure exceptions
 *
 * Modify the relative priorities of Secure and Non-secure interrupts,
 * so that the priority range for Secure interrupts extends to higher
 * priorities than the range for Non-secure interrupts.
 *****************************************************************************/
static inline void prioritise_secure_exceptions(void)
{
  uint32_t scb_AIRCR = SCB->AIRCR;
  uint32_t scb_vectkey = AIRCR_UNLOCK_VECTKEY;
  SCB->AIRCR = SCB_AIRCR_PRIS_Msk
               | (scb_vectkey << SCB_AIRCR_VECTKEY_Pos)
               | (scb_AIRCR & ~SCB_AIRCR_VECTKEY_Msk);
}

/**************************************************************************//**
 * @brief Enables SecureFault, BusFault, UsageFault, and MemFault system
 *        exceptions.
 *****************************************************************************/
static inline void enable_fault_exceptions(void)
{
  // Enable SecureFault, BusFault, UsageFault and MemFault.
  SCB->SHCSR |= SCB_SHCSR_SECUREFAULTENA_Msk
                | SCB_SHCSR_BUSFAULTENA_Msk
                | SCB_SHCSR_USGFAULTENA_Msk
                | SCB_SHCSR_MEMFAULTENA_Msk;
}

/**************************************************************************//**
 * @brief Enable the FPU for the non-secure app.
 *****************************************************************************/
static inline void enable_ns_fpu(void)
{
  SCB->NSACR |= (SCB_NSACR_CP10_Msk)    // enable CP10 Full Access
                | (SCB_NSACR_CP11_Msk); // enable CP11 Full Access
}

/**************************************************************************//**
 * @brief Enable the flash page locks corresponding to the bootloader and
 *        secure library code.
 *****************************************************************************/
static inline void enable_page_locks(void)
{
  #if defined(_CMU_CLKEN1_MASK)
  CMU->CLKEN1_SET = CMU_CLKEN1_MSC;
  #endif

  size_t pages_to_lock = NUM_PAGES_TO_LOCK;

