espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_trustzone/src/sli_tz_secure_main.c
  // Iterate over pagelock registers and set as many ones needed.
  for (size_t i = 0; i < NUM_PAGELOCK_REGISTERS; ++i) {
    if (pages_to_lock < 32u) {
      // It is possible that pages_to_lock is equal to zero at this point
      // (for example when the total amount of pages to lock is zero mod 32).
      // This should not be a problem though, as pushing 0 into _SET is a no-op
      *pagelock_registers[i] = (1u << pages_to_lock) - 1;
      pages_to_lock = 0u;
      break;
    } else {
      *pagelock_registers[i] = 0xffffffffu;
      pages_to_lock -= 32u;
    }
  }

  #if defined(_CMU_CLKEN1_MASK)
  CMU->CLKEN1_CLR = CMU_CLKEN1_MSC;
  #endif
}

/**************************************************************************//**
 * @brief Start non-secure app.
 *
 * This function should not return.
 *****************************************************************************/
static inline void start_ns_app(void)
{
  // Set stack pointer.
  __TZ_set_MSP_NS(*((uint32_t *)(FLASH_BASE + TZ_NS_FLASH_OFFSET)));
  __TZ_set_PSP_NS(*((uint32_t *)(FLASH_BASE + TZ_NS_FLASH_OFFSET)));

  // Set vector table (may be done by SystemInit() on NS side, but do it here to
  // be sure).
  SCB_NS->VTOR = (FLASH_BASE + TZ_NS_FLASH_OFFSET);

  // Call non-secure reset handler.
  nsfunc fp = (nsfunc) * ((uint32_t *)((FLASH_BASE + TZ_NS_FLASH_OFFSET) + 4UL));
  fp();
}

#if defined(MBEDTLS_PSA_CRYPTO_STORAGE_C) && defined(SLI_PSA_ITS_ENCRYPTED)

#if defined(SEMAILBOX_PRESENT)
/**************************************************************************//**
 * @brief Verify that the HSE has a supported firmware version.
 *
 * The Storage Root Key must be present in order for the TrustZone-enabled
 * secure key storage to work. Support for this was added in SE FW v1.2.12,
 * which is the minimum version supported.
 *****************************************************************************/
static inline void verify_hse_version(void)
{
  sl_se_command_context_t cmd_ctx;
  uint32_t se_version = 0;
  sl_status_t status = sl_se_get_se_version(&cmd_ctx, &se_version);
  if (status != SL_STATUS_OK) {
    INFINITE_LOOP();
  }
  if (!SLI_SE_VERSION_SUPPORTS_SRK(se_version)) {
    // SE firmware version must be at least v1.2.12 for xG21/xG22 and at least
    // v2.2.0 for xG23+.
    INFINITE_LOOP();
  }
}
#endif

#if !defined(SEMAILBOX_PRESENT)
/**************************************************************************//**
 * @brief Setup Storage Root Key (SRK)
 *
 * Reads the TrustZone Root Key / Storage Root Key passed from the VSE and
 * configures ITS to use it for NVM3 encryption.
 *****************************************************************************/
static inline void setup_storage_root_key(void)
{
  #if defined(CRYPTOACC_PRESENT)

  #define VSE_REPLY_SIZE_WORDS                  5
  #define VSE_REPLY_STATUS_TRUSTZONE_ROOT_KEY   (1 << 22)
  #define TZ_SRK_SIZE_WORDS                     8

  typedef struct {
    uint32_t data[TZ_SRK_SIZE_WORDS];
    uint32_t checksum;
  } vse_srk_t;

  // Store current CLKEN0 state
  uint32_t clken0_state = CMU_S->CLKEN0;

  // Read the SRK next to the VSE mailbox
  CMU_S->CLKEN0_SET = CMU_CLKEN0_SYSCFG;
  uint32_t *vse_reply = (uint32_t*)SYSCFG_S->ROOTDATA1;

  // Restore prior CLKEN0 state
  CMU_S->CLKEN0 = clken0_state;

  // Verify that the SE version supports SRK
  uint32_t se_version = vse_reply[1];
  if (!SLI_SE_VERSION_SUPPORTS_SRK(se_version)) {
    // SE firmware version must be at least v1.2.12 for xG21/xG22 and at least
    // v2.2.0 for xG23+.
    INFINITE_LOOP();
  }

  // Verify that the TrustZone Root Key flag is present in the reply status
  uint32_t vse_reply_status = vse_reply[2];
  if ((vse_reply_status & VSE_REPLY_STATUS_TRUSTZONE_ROOT_KEY) == 0) {
    INFINITE_LOOP();
  }

  // Read the SRK next to the mailbox, i.e. after the VSE reply header, data length and
  // checksum (+1).
  uint32_t vse_data_length = vse_reply[4];
  vse_srk_t *srk = (vse_srk_t*)(vse_reply + VSE_REPLY_SIZE_WORDS + vse_data_length + 1);

  // Verify checksum
  uint32_t checksum = 0;
  for (uint32_t i = 0; i < sizeof(srk->data) / sizeof(uint32_t); ++i) {
    checksum ^= srk->data[i];
  }
  if (checksum != srk->checksum) {
    INFINITE_LOOP();
  }

  // Set the ITS root key. Note that this function is not dependent on PSA Crypto
  // being initialized.
  psa_status_t status = sli_psa_its_set_root_key((uint8_t*)srk->data,
                                                 sizeof(srk->data));
  if (status != PSA_SUCCESS) {
    INFINITE_LOOP();
  }

  // Clear the SRK from the mailbox location
  sli_psa_zeroize(srk, sizeof(vse_srk_t));
  #else // defined(CRYPTOACC_PRESENT)
    #error "Unknown device without SEMAILBOX (HSE) or CRYPTOACC (VSE)"
  #endif // defined(CRYPTOACC_PRESENT)
}
#endif // !SEMAILBOX_PRESENT

#endif // defined(MBEDTLS_PSA_CRYPTO_STORAGE_C) && defined(SLI_PSA_ITS_ENCRYPTED)

// -----------------------------------------------------------------------------
// Fault handlers

void SMU_SECURE_IRQHandler(void)
{
  fatal_error();
}

void HardFault_Handler(void)
{
  fatal_error();
}

void SecureFault_Handler(void)
{
  fatal_error();
}

void UsageFault_Handler(void)
{
  fatal_error();
}

void BusFault_Handler(void)
{
  fatal_error();
}

void mpu_fault_handler(void)
{
  fatal_error();
}
